In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'], 
                    'k2': ['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha
1  2.822836  2.545102  X   beta
2  1.682764  0.691863  Y  alpha
3  1.083973 -0.406830  Y   beta
4 -0.697565  0.462748  Z  alpha

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X    1.590119
Y    1.383368
Z   -0.697565
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])
month = np.array([ 'JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha
1  2.822836  2.545102  X   beta
2  1.682764  0.691863  Y  alpha
3  1.083973 -0.406830  Y   beta
4 -0.697565  0.462748  Z  alpha

In [9]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB    2.822836
    JAN    1.682764
NY  FEB    1.083973
    JAN   -0.170082
Name: dataset1, dtype: float64

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.357402 -0.135307
   beta   2.822836  2.545102
Y  alpha  1.682764  0.691863
   beta   1.083973 -0.406830
Z  alpha -0.697565  0.462748

In [12]:
dframe.groupby(['k1','k2'])

In [13]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [14]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.135307
   beta   2.545102
Y  alpha  0.691863
   beta  -0.406830
Z  alpha  0.462748

In [15]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [16]:
for name, group in dframe.groupby('k1'): 
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha
1  2.822836  2.545102  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  1.682764  0.691863  Y  alpha
3  1.083973 -0.406830  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.697565  0.462748  Z  alpha

In [17]:
for (k1, k2), group in dframe.groupby(['k1','k2']): 
    print('Key1={} Key2={}'.format(k1, k2))
    print(group)
    print('\n')

Key1=X Key2=alpha
   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha


Key1=X Key2=beta
   dataset1  dataset2 k1    k2
1  2.822836  2.545102  X  beta


Key1=Y Key2=alpha
   dataset1  dataset2 k1     k2
2  1.682764  0.691863  Y  alpha


Key1=Y Key2=beta
   dataset1  dataset2 k1    k2
3  1.083973  -0.40683  Y  beta


Key1=Z Key2=alpha
   dataset1  dataset2 k1     k2
4 -0.697565  0.462748  Z  alpha

In [18]:
gr = dframe.groupby('k1')

In [19]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha
1  2.822836  2.545102  X   beta

In [24]:
group_dict = dict(list(dframe.groupby('k1')))

In [25]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.357402 -0.135307  X  alpha
1  2.822836  2.545102  X   beta

In [26]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [27]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.357402 -0.135307
 1  2.822836  2.545102
 2  1.682764  0.691863
 3  1.083973 -0.406830
 4 -0.697565  0.462748, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}